Тест/Тест/src/Documents/ЗаявкаНаРасход/ЗаявкаНаРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРасход</name>
  <basedOn>Document.АктВозврата</basedOn>
  <basedOn>Document.ПоступлениеЗапчастей</basedOn>
  <basedOn>Document.Расходы</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.дт_СтатусыЗаявокНаРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасхода</name>
    <type>
      <types>CatalogRef.ВидыРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
      <types>CatalogRef.ПроектыРазработки</types>
      <types>DocumentRef.АктВозврата</types>
      <types>DocumentRef.ПродажаЗапчастей</types>
      <types>CatalogRef.Инвентарь</types>
      <types>DocumentRef.ЗаказНаряд</types>
      <types>DocumentRef.ЛистыУщерба</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринятоБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскиеСчета</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Кредит</name>
    <type>
      <types>DocumentRef.ПриходОтКредитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлнируемыйРасход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоНакладной</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПроизводителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТМЦ</name>
    <attributes>
      <name>НоменклатураТМЦ</name>
      <type>
        <types>CatalogRef.ТМЦВорктрак</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоНакладной</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИнвентаря</name>
      <type>
        <types>CatalogRef.ВидыИнвентаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/РасчетыСПоставщиками/РасчетыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ПоступлениеЗапчастей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Catalogs/ВидыРасходов/ВидыРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыРасходов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>КредитПлатеж</name>
      <description>Кредит платеж</description>
    </items>
    <items>
      <name>Топливо</name>
      <description>Топливо</description>
    </items>
  </predefined>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииСписаниеДенежныхСредств</name>
    <type>
      <types>EnumRef.ВидыОперацийСписаниеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест/Тест/src/Documents/ЗаявкаНаРасход/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктВозврата") Тогда
		// Заполнение шапки
		Статус 		   = Перечисления.дт_СтатусыЗаявокНаРасход.Внепланово;
		Инициатор 	   = Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь",ДанныеЗаполнения.Ответственный);
		Основание 	   = ДанныеЗаполнения.Ссылка;
		ВидРасхода	   = Справочники.ВидыРасходов.НайтиПоКоду("000000041");
		Получатель 	   = ДанныеЗаполнения.Ответственный;
		Ответственный  = ДанныеЗаполнения.Ответственный;
		СуммаДокумента = ДанныеЗаполнения.ОбщаяСумма;
		
		Для Каждого ТекСтрокаТаблица Из ДанныеЗаполнения.Таблица Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТаблица.Товар;
			НоваяСтрока.Количество 	 = ТекСтрокаТаблица.Количество;
			НоваяСтрока.Отменено 	 = ТекСтрокаТаблица.Отменено;
			НоваяСтрока.Сумма 		 = ТекСтрокаТаблица.Сумма;
			НоваяСтрока.Цена 		 = ТекСтрокаТаблица.Цена;
		КонецЦикла;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеЗапчастей") Тогда
		
			
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПоступлениеЗапчастей.Поставшик КАК Поставшик,
			|	ПоступлениеЗапчастей.Организация КАК Организация,
			|	ВЫБОР
			|		КОГДА ПоступлениеЗапчастей.Проведен
			|			ТОГДА ЕСТЬNULL(РасчетыСПоставщикамиОстатки.СуммаОстаток, 0)
			|		ИНАЧЕ ПоступлениеЗапчастей.СуммаНакладной
			|	КОНЕЦ КАК СуммаДокумента,
			|	ПоступлениеЗапчастей.Проект КАК Проект
			|ИЗ
			|	Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(, Сделка = &Ссылка) КАК РасчетыСПоставщикамиОстатки
			|		ПО (РасчетыСПоставщикамиОстатки.Сделка = ПоступлениеЗапчастей.Ссылка)
			|ГДЕ
			|	ПоступлениеЗапчастей.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаШапка = РезультатЗапроса.Выбрать();
		ВыборкаШапка.Следующий(); 
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
		
		Основание = ДанныеЗаполнения;
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику");
		
		ВидРасхода = дт_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьОсновнойВидРасхода(ВидОперации);
		Для Каждого ТекСтрокаТаблица Из ДанныеЗаполнения.Таблица Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТаблица.Товар;
			НоваяСтрока.Количество 	 = ТекСтрокаТаблица.Колво;
			НоваяСтрока.Сумма 		 = ТекСтрокаТаблица.СуммаПоступления;
			НоваяСтрока.Цена 		 = ТекСтрокаТаблица.ЦенаПоступления;
		КонецЦикла;
		
	    Инициатор = ОтборИнициатора(ДанныеЗаполнения); 
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Инициатор);

		Счет = ОтборСчета(ДанныеЗаполнения); 
		
		Получатель = ДанныеЗаполнения.Поставшик; 
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.дт_СтатусыЗаявокНаРасход.Планово;
	КонецЕсли; 
	// ++МазинЕС 24-05-24
			
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Расходы") Тогда
				// Заполняем шапку
				Инициатор 	   = ДанныеЗаполнения.Инициатор; 
				Основание 	   = ДанныеЗаполнения.Основание;
				ВидРасхода	   = ДанныеЗаполнения.ВидРасхода;
				Подразделение  = ДанныеЗаполнения.Подразделение; 
			
				
				Запрос = Новый Запрос;
				Запрос.Текст =
					"ВЫБРАТЬ
					|	ПоступлениеЗапчастейТаблица.Код КАК Код,
					|	ПоступлениеЗапчастейТаблица.Товар.НомерПроизводителя КАК НомерПроизводителя,
					|	ПоступлениеЗапчастейТаблица.Товар КАК Номенклатура,
					|	ПоступлениеЗапчастейТаблица.Колво КАК Колво,
					|	ПоступлениеЗапчастейТаблица.СуммаПоступления КАК СуммаПоступления,
					|	ПоступлениеЗапчастейТаблица.ЦенаПоступления КАК ЦенаПоступления
					|ИЗ
					|	Документ.ПоступлениеЗапчастей.Таблица КАК ПоступлениеЗапчастейТаблица
					|ГДЕ
					|	ПоступлениеЗапчастейТаблица.Ссылка = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка",Основание );
				
				РезультатЗапроса = Запрос.Выполнить();
				Структура = Новый Структура; 
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						НоваяСтрока = Товары.Добавить();
						НоваяСтрока.Код 				= ВыборкаДетальныеЗаписи.Код;
						НоваяСтрока.НомерПроизводителя  = ВыборкаДетальныеЗаписи.НомерПроизводителя;
						НоваяСтрока.Номенклатура 		= ВыборкаДетальныеЗаписи.Номенклатура; 
						НоваяСтрока.Количество 			= ВыборкаДетальныеЗаписи.Колво; 
						НоваяСтрока.Цена 				= ВыборкаДетальныеЗаписи.ЦенаПоступления;
						НоваяСтрока.Сумма 				= ВыборкаДетальныеЗаписи.СуммаПоступления;	 
				
				КонецЦикла;
		

			Конецесли; 
	// --МазинЕС 24-05-24
	
	
КонецПроцедуры

//Волков И.О. 29.11.2023 ++ 
Функция ОтборИнициатора(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка КАК Ответственный
	|ИЗ
	|	Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ПоступлениеЗапчастей.Ответственный = Сотрудники.Пользователь
	|ГДЕ
	|	ПоступлениеЗапчастей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();
	Пока ВыборкаШапка.Следующий() Цикл
		
		Инициатор = ВыборкаШапка.Ответственный;
		
	КонецЦикла;
	
	Возврат Инициатор;
КонецФункции  

Функция ОтборСчета(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Счета.Ссылка КАК СчетСсылка
	|ИЗ
	|	Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Счета КАК Счета
	|		ПО ПоступлениеЗапчастей.Организация = Счета.Владелец
	|ГДЕ
	|	ПоступлениеЗапчастей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШапка = РезультатЗапроса.Выбрать();	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Счет = ВыборкаШапка.СчетСсылка;
		
	КонецЦикла;
	
	Возврат Счет;
	
КонецФункции
//Волков И.О. 29.11.2023 --

Процедура ПриКопировании(ОбъектКопирования)
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ДополнительныеСвойства.Вставить("ЭтоНовый",                    ЭтоНовый()); 
	ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь); 
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
//	
//	ПараметрыПроведения = Документы.ЗаказКлиента.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;
	
	
	// Формирование движений
//	дт_Ценообразование.ОтразитьДвижения(ПараметрыПроведения, Движения, Отказ);
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Если Товары.Количество() <> 0 Тогда
		
		СтрокиАктивные = Товары.НайтиСтроки(Новый Структура("Отменено", Ложь));
		Сумма = 0;
		Для каждого СтрокаТаблицы Из СтрокиАктивные Цикл
			Сумма = Сумма + СтрокаТаблицы.Сумма;
		КонецЦикла;
		
		СуммаДокумента = Сумма;
		
	КонецЕсли;	
// ++ МазинЕС 19-06-2024 // Реквизит ПлнируемыйРасход используется 
// в Динамическом списке ПлатежныйКалендарь
Если ДатаОплаты > Дата Тогда 
ПлнируемыйРасход = Истина; 
Иначе ПлнируемыйРасход = Ложь; 
КонецЕсли; 
// ++ МазинЕС 19-06-2024 	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
